app/views/transactions/new.html.erb

SELECT "categories".* FROM "categories"
---
  <%= form.label :category_id, "Category" %><br>
  <%= form.collection_select :category_id, Category.all, :id, :name, { prompt: "Select a category" }, { required: true } %>